Revit 2024 API
GroupTypeId.Pattern Property
 Pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId Pattern { get; }
Visual Basic
Public Shared ReadOnly Property Pattern As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Pattern {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace